Revit 2026 API

# LinkLoadContent Methods

---

The LinkLoadContent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ExternalResourceLoadContent) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLinkDataPath | Returns the Link data path owned by this LinkLoadContent object. |
|  | GetLinkLoadResult | Retrieves the LinkLoadResult of the attempt to load or reload a Revit link. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetLinkDataPath | Sets the Link data path owned by this LinkLoadContent object. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

LinkLoadContent Class

Autodesk.Revit.DB Namespace